Catalogs/JobQueueDataAreas.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.1">
	<Catalog>
		<Properties>
			<Name>JobQueueDataAreas</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Use</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ScheduledStartTime</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>JobState</Name>
					<Type>
						<v8:Type>cfg:EnumRef.JobStates</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ActiveBackgroundJob</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ExclusiveExecution</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Pattern</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.QueueJobsTemplates</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>TryNumber</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>MethodName</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Parameters</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>LastStartDate</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CompletionDateLastRun</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Key</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>128</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>RestartIntervalOnFailure</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Schedule</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>RestartCountOnFailure</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

CommonModules/AdditionalReportsAndDataProcessorsScheduledJobsSaaS/Ext/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// Additional Reports And Data Processors in Service Models
// subsystem, procedures and functions to manage queue jobs.
// 
////////////////////////////////////////////////////////////////////////////////

////////////////////////////////////////////////////////////////////////////////
// PROGRAMMING INTERFACE

// It creates a job of the job queue.
//
// Return value: CatalogRef.JobQueueDataAreas.
//
Function CreateNewJob() Export
	
	SetPrivilegedMode(True);
	
	JobParameters = New Structure();
	JobParameters.Insert("Use", False);
	JobParameters.Insert("MethodName", Metadata.ScheduledJobs.LaunchAdditionalDataProcessors.MethodName);
	
	Return JobQueue.AddJob(JobParameters);
	
EndFunction

// It returns the queue job ID (to save in the infobase data).
//
// Task - CatalogRef.JobQueueDataAreas.
//
// Return value: UUID.
//
Function GetIDTasks(Val Task) Export
	
	SetPrivilegedMode(True);
	Return Task.UUID();
	
EndFunction

// It sets the job parameters of the job queue.
//
// Parameters:
//  Task - CatalogRef.JobQueueDataAreas,
//  Use - Boolean, flag of using the scheduled job,
//  Parameters - Array(Arbitrary), scheduled job parameters,
//  Schedule - ScheduledJobSchedule.
//
Procedure SetJobParameters(Task, Use, Parameters, Schedule) Export
	
	If Not Constants.AllowAdditionalReportsAndDataProcessorsPerformByProceduralTasksSaaS.Get() Then
		Raise NStr("en = 'Service administration prohibited the regular execution of additional data processors commands as jobs!'");
	EndIf;
	
	MinInterval = Constants.AdditionalReportsAndDataProcessorsProceduralTasksMinIntervalSaaS.Get();
	OriginalDate = CurrentSessionDate();
	ChackedDate = OriginalDate + MinInterval - 1;
	If Schedule.ExecutionRequired(ChackedDate, OriginalDate) Then
		
		Raise StringFunctionsClientServer.PlaceParametersIntoString(
			NStr("en = 'Schedule specified for the execution of additional report or data processor commands as jobs, should not be more than once in %1 seconds!'"), MinInterval);
		
	EndIf;
	
	SetPrivilegedMode(True);
	
	JobParameters = New Structure();
	JobParameters.Insert("Use", Use);
	JobParameters.Insert("MethodName", Metadata.ScheduledJobs.LaunchAdditionalDataProcessors.MethodName);
	JobParameters.Insert("Parameters", Parameters);
	JobParameters.Insert("Key", Metadata.ScheduledJobs.LaunchAdditionalDataProcessors.Key);
	JobParameters.Insert("Schedule", Schedule);
	
	JobQueue.ChangeTask(Task, JobParameters);
	
EndProcedure

// It returns the job parameters of the job queue.
//
// Parameters:
//  Task - CatalogRef.JobQueueDataAreas.
//
// Return value: Structure, key description - see returned value
//  description for the JobQueue.GetJobs() function.
//
Function GetJobParameters(Val Task) Export
	
	SetPrivilegedMode(True);
	Return JobQueue.GetJobs(New Structure("ID", Task))[0];
	
EndFunction

// It performs the queue job searching by the
// identifier (probably, saved in the infobase data).
//
// Parameters: Identifier - UUID
//
// Return value: CatalogRef.JobQueueDataAreas.
//
Function FindJob(Val ID) Export
	
	SetPrivilegedMode(True);
	
	Task = Catalogs.JobQueueDataAreas.GetRef(ID);
	If CommonUse.RefExists(Task) Then
		Return Task;
	Else
		Return Undefined;
	EndIf;
	
EndFunction

// It deletes a job of the job queue.
//
// Parameters:
// Task - CatalogRef.JobQueueDataAreas.
//
Procedure DeleteJob(Val Task) Export
	
	SetPrivilegedMode(True);
	
	If TypeOf(Task) = Type("CatalogRef.JobQueueDataAreas") Then
		JobQueue.DeleteJob(Task);
	EndIf;
	
EndProcedure
